"====================Tuple======================="
#Кортеж - неизменяемый, индексируемый, упорядоченный, итерируемый тип данных, предназанченный для хранения любых данных в определенном порядке 
#(в целом не отличается от списков просто не изменяемый, поэтому занимет меньше памяти)

tuple1 = (1,2,3) #(1,2,3)
tuple2 = ('hello', 2.5, 19, (2,3), [1,2,3])
tuple2[-1].append(4) #добавит 4 ('hello', 2.5, 19, (2,3), [1,2,3,4])

tuple3 = tuple('hello') #('h', 'e', 'l', 'l', 'o')
tuple3_=tuple([1,2,3]) #(1,2,3)

tuple4 = 1,2,3 #(1,2,3)
tuple5 = (5) # 5 (int)
tuple6 = 5, #(5,)
tuple7 = 'hello'


"==========Методы tuple============"
# count считает количество принятого элемента в кортеже
tuple_ = (1,2,1,4,1,5,1,7,2,4,4)
tuple_.count(1) # 4
tuple_.count(2) # 2
tuple_.count(4) # 3

tuple_ = ('hello', 'hello', 'hello')
tuple_.count('h') # 0
tuple_.count('hello') # 3
len(tuple_) # 3

# index возвращает индекс первого вхождения принятого элемента
tuple1 = (1,2,3,4,1,2,3,5,4,1)
tuple1.index(3) # 2
tuple1.index(1) # 0

a,b = 5,4
a = 5,4